/* rexx */
SAY RESULT IS PROG2(13,99)
EXIT

/* 
return num1 * num2
arg(1) : num1 
arg(2) : num2 
*/
PROG1: PROCEDURE
	IF ARG() <> 2 THEN 
		RETURN 'PARAM ERROR'
	ELSE 
	 	RETURN ARG(1) * ARG(2)


/*
INVOKE A PROCEDURE IN A PROCEDURE
*/
PROG2: PROCEDURE
	RETURN PROG1(ARG(1),ARG(2))